base/InformationRegisters/СинхронизацияДанныхЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СинхронизацияДанныхЗЕРНО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИмяЗапросаЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/СинхронизацияДанныхЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить дату выполнения синхронизации.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - содержит ключи:
//    * Организация - ОпределяемыйТип.Организация.
//    * Подразделение - ОпределяемыйТип.Подразделение.
//    * ДатаСинхронизации - Дата.
//    * ИмяЗапроса - ПеречислениеСсылка.ИмяЗапросаЗЕРНО.
Процедура УстановитьДатуВыполненияСинхронизации(ПараметрыЗаписи) Экспорт
	
	Организация       = ПараметрыЗаписи.Организация;
	Подразделение     = ПараметрыЗаписи.Организация;
	ДатаСинхронизации = ПараметрыЗаписи.ДатаСинхронизации;
	ИмяЗапроса        = ПараметрыЗаписи.ИмяЗапроса;
	
	Если Организация = Неопределено Тогда
		Организация = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация");
	КонецЕсли;
	
	Если Подразделение = Неопределено Тогда
		Подразделение = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяЗапроса.Установить(ПараметрыЗаписи.ИмяЗапроса);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
	
	Если ДатаСинхронизации <> Неопределено И ДатаСинхронизации > '00010101' Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИмяЗапроса        = ИмяЗапроса;
		ЗаписьНабора.ДатаСинхронизации = ДатаСинхронизации;
		ЗаписьНабора.Организация       = Организация;
		ЗаписьНабора.Подразделение     = Подразделение;
		ЗаписьНабора.ДатаОбмена        = ТекущаяУниверсальнаяДата();
		
		НаборЗаписей.Записать();
		
	Иначе
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Выбран()
			И НаборЗаписей.Количество() > 0 Тогда
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ДатаОбмена = ТекущаяУниверсальнаяДата();
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
